LEXICON = {
    "admin_start": "Привет! Вижу, что вы администратор. Здесь можно создать и настроить игры.",
    "admin_save_promo_get_image": "Для сохранения промо-кода отправьте картинку с описанием промо-кода в текстовом виде, для отмены напите /cancel",
    "admin_save_promo_get_label": "Отправьте, пожалуйста, уникальный идентификатор промо-кода (промо-код в текстовом виде)",
    "admin_save_promo_ok": "Промо-код добавлен!",
    "admin_edit_promos": "Для редактирования промо-кодов выберите нужный из списка",

    "user_panda_info": (
        "Адреса проживания панды:\n\n"
        "🏙Ставрополь\n\n"
        "📍ул. Тухачевского, 26/2\n"
        "📍ул. Тухачевского, 30\n"
        "📍ул. Макарова, 26\n"
        "📍ул. Серова, 478б\n"
        "📱8-800-600-65-63\n\n"
        "🌃Пятигорск:\n\n"
        "Самовывоз с ул. Малыгина, 24В \n"
        "или доставка\n"
        "📱 8-800-600-65-63\n\n"
        "🌆Буденновск:\n"
        "Только доставка\n"
        "📱 8-800-600-65-63"
    ),

    "user_start": (
        "Привет👋🏻\n\n"
        "Меня зовут Панда Бо🐼\n"
        "Я люблю вкусно кушать и угощать своих друзей!\n"
        "Будем дружить?\n\n"
        "Если хотите дружить, сначала нам нужно познакомиться, поэтому отправляйте /register"
    ),

    "user_registration_request_name": (
        "Меня зовут Панда бо🐼✨\n\n"
        "А как тебя зовут?"
    ),
    "user_registration_request_phone_number": (
        "Приятно познакомиться, %s 🙌🏻\n\n"
        "А еще поделишься, пожалуйста, номером телефона? 👉👈🐼\n\n"
        "Кнопка есть снизу, печатать номер не нужно - со мной всегда просто 🙌"
    ),
    "user_registration_phone_number_accepted": (
        "Спасибо!\n\n"
        "Запишу как \"Лучший друг\" ✍️"
    ),
    "user_registration_greeting": (
        "Теперь мы настоящие друзья✨\n"
        "А значит, будем играть с тобой в игры, получать подарки и отлично проводить время🥳\n\n"
        "Один подарок уже готов!\n"
        "Пришли команду /promo, чтобы получить крутейший промокод🎁"
    ),

    "user_answer_correct": "Это правильный ответ🥳",
    "user_answer_incorrect": "К сожалению, это неправильный ответ☹️\nНо вы были близки✨",

    "user_help": (
        "Здесь ты можешь пообщаться с пандой Бо🐼\n\n"
        "Выигрывать вкусные подарки, бонусы и промокоды 🎁\n\n"
        "Давай поговорим о том, что я умею🤓☝🏻\n\n"
        "▪️/promo – так ты можешь получить актуальные промокоды!\n"
        "▪️/info – так ты можешь узнать, где можно найти самую вкусную еду, а еще как ее заказать!"
    ),

    "promo_register_first": (
        "Чтобы получить промокод, сначала нужно подружиться с Пандой Бо 🐼☝️\n"
        "Напиши, пожалуйста, команду\n"
        "/register\n"
    ),
    "promo_no_promos": (
        "Оу, промокоды закончились🐼\n\n"
        "Такое бывает, проверь завтра - возможно, я что-то придумаю☝️"
    ),

    "dont_understand": "Извини, я тебя не понимаю"
}


USER_MENU = {
    "/spin": "Крути рулетку",
    "/help": "Справка по работе бота",
    "/register": "Подружиться с Пандой Бо",
    "/promo": "Получить актуальные промо-коды от Бо",
    "/info": "Информация о Панда Маркет",
}

ADMIN_MENU = {
    "/create_game": "Создать игру",
    "/launch_long_game": "Запустить длинную игру",
    "/launch_game": "Задать параметры запуска игры",
    "/stop_game": "Завершить игру",
    "/get_results": "Узнать результаты игры",
    "/get_user_count": "Узнать количество пользователей",
    "/giveaway": "Создать розыгрыш",
    "/delete_short": "Удалить короткую игру",
    
    "/add_promo": "Добавить промо-код",
    "/edit_promos": "Настроить промо-коды",
    "/list_users": "Получить список пользователей",
    "/message_users": "Отправить сообщение всем пользователям бота",
    "/message_user": "Отправить сообщение всем пользователям бота",
    "/get_user_count": "Узнать количество пользователей",
    "/load_json_game": "Загрузить короткую игру по упрощённой схеме",
    "/post": "Сделать пост в канал @pandamarket_club с кнопкой \"Подружиться с пандой Бо!\""
}


class Lexicon:
    class Admin:
        class Lotteries:
            example_config = \
"""{
    "label": "2024-12-20",
    "gift_percent": 3,
    "bonus_point_percent": 15,
    "start": "2024-12-20",
    "end": "2025-01-15",
    "gifts": {
        "mochi": 10,
        "pizza": 5,
        "rolls": 5
    },
    "bonus_points": {
        "quantity": 10000,
        "options": [ 100, 300, 500 ]
    }
}"""
    class User:
        refill_success = (
            "Панда Бо начислил тебе {quantity} бонусных рублей\n\n"
            "Беги скорее заказывать вкусняшки🐼✨\n\n"
            "Здесь это можно удобно сделать👇🏻\n"
            "https://pandamarket.ru/\n\n"
            "Будь осторожен, потому что баллы сгорят через неделю"
        )
        refill_no_account = (
            "Панда Бо не смог найти тебя в числе своих друзей🐼\n\n"
            "Зарегистрируйся, пожалуйста, в бонусной программе по ссылке ниже👇🏻\n"
            "https://join2.club/panda\n\n"
            "Чтобы Панда Бо мог радовать тебя подарками✨"
        )
