LEXICON = {
    # 'registration_greeting': 'Прекрасно! Теперь вы сможете участвовать в розыгрышах 🎉 \nТакже за регистрацию Бо дарит 🎁 вам крутой промо-код, чтобы его забрать, напишите /promo',
    'admin_start': 'Привет! Вижу, что вы администратор. Здесь можно создать и настроить игры.',
    'admin_save_promo_get_image': 'Для сохранения промо-кода отправьте картинку с описанием промо-кода в текстовом виде, для отмены напите /cancel',
    'admin_save_promo_get_label': 'Отправьте, пожалуйста, уникальный идентификатор промо-кода (промо-код в текстовом виде)',
    'admin_save_promo_ok': 'Промо-код добавлен!',
    'admin_edit_promos': 'Для редактирования промо-кодов выберите нужный из списка',
    'user_panda_info': 'Адреса проживания панды:\n\n🏙️Ставрополь\n\n📍ул.Тухачевского 26/3\n📍ул. Васильева, 49\n📍ул.Серова, 478б\n📱8-800-600-65-63\n\n🌃Пятигорск:\n\nСамовывоз с ул. Малыгина, 24В \nили доставка\n📱 8-800-600-65-63\n\n🌆Буденновск:\nТолько доставка\n📱 8-800-600-65-63',
    'user_start': 'Привет👋🏻\n\nМеня зовут Панда Бо🐼\nЯ люблю вкусно кушать и угощать своих друзей!\nБудем дружить?\n\nЕсли хотите дружить, сначала нам нужно познакомиться, поэтому отправляйте /register',
    'user_registration_ask_name': 'Как Вас зовут?',
    'user_registration_ask_mail': 'Приятно познакомиться, %s🙌🏻\nА какой у Вас почтовый ящик?\nНастоящие друзья должны знать такие вещи😌☝🏻',
    'user_registration_ask_phone': 'А как же нам быть без номера телефона?\nПришлите и его, пожалуйста, вдруг мне станет скучно🐼',
    'user_registration_greeting': 'Теперь мы настоящие друзья✨\nА значит будем играть с вами в игры, получать подарки и отлично проводить время🥳\n\nОдин подарок уже готов!\nПришлите команду /promo, чтобы получить крутейший промокод🎁',
    'user_answer_correct': 'Это правильный ответ🥳',
    'user_answer_incorrect': 'К сожалению, это неправильный ответ☹️\nНо вы были близки✨',
    'user_help': 'Здесь вы можете пообщаться с пандой Бо🐼\n\nВыигрывать вкусные подарки, бонусы и промокоды 🎁\n\nДавайте немного поговорим о том, что я умею🤓☝🏻\n\n▪️/promo – так вы можете получить актуальные промокоды!\n▪️/info – так вы можете узнать, где можно найти самую вкусную еду, а еще как ее заказать!'
}

USER_MENU = {
    '/help': 'Справка по работе бота',
    '/register': 'Зарегистрироваться для участия в конкурсах',
    '/promo': 'Получить актуальные промо-коды от Бо',
    # '/points': 'Посмотреть бонусные баллы',
    '/info': 'Информация о Панда Маркет'
}

ADMIN_MENU = {
    '/create_game': 'Создать игру',
    '/launch_game': 'Задать параметры запуска игры',
    '/stop_game': 'Завершить игру',
    # '/stop_game_test': 'Завершить тестовую игру',
    '/get_results': 'Узнать результаты игры',
    '/add_promo': 'Добавить промо-код',
    '/edit_promos': 'Настроить промо-коды',
    '/list_users': 'Получить список пользователей',
    '/message_users': 'Отправить сообщение всем пользователям бота',
    '/message_user': 'Отправить сообщение всем пользователям бота'
}
